Tauser/Noisebot-v2/firmware/sdkconfig.defaults
# NoiseBot 2 — defaults (Freenove ESP32-S3 CAM N16R8: 16MB flash, 8MB PSRAM octal)

CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logs (dev; produção usa nível INFO e CONFIG_NB2_DEV_BUILD desligado — S1.3)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Coredump em flash (S1.3)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Watchdog (S1.5 endurece)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Segurança — habilitados de verdade em S1.8 (exigem gestão de chaves; ver SECURITY.md):
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
